adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51G19A.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no"?><edc:PIC xmlns:edc="http://crownking/edc" xmlns:atdf="http://crownking/atdf" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" atdf:architecture="CORTEX-M4" atdf:family="SAMD" edc:arch="arm32bit" edc:atsamname="ATSAMD51G19A" edc:hasfreeze="false" edc:name="ATSAMD51G19A" edc:procid="0x0000" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power>
    <edc:VDD edc:maxvoltage="3.60" edc:minvoltage="1.71" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true"/>
  <edc:ArchDef edc:desc="arm32bit" edc:name="arm32bit">
    <edc:MemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFFFFFFFF" edc:wordinit="0xFFFFFFFF" edc:wordsafe="0xFFFFFFFF" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="armv7m"/>
  <edc:InterruptList>
    <edc:Interrupt edc:cname="Reset" edc:desc="Reset Vector, invoked on Power up and warm reset" edc:irq="-15"/>
    <edc:Interrupt edc:cname="NonMaskableInt" edc:desc="Non maskable Interrupt, cannot be stopped or preempted" edc:irq="-14"/>
    <edc:Interrupt edc:cname="HardFault" edc:desc="Hard Fault, all classes of Fault" edc:irq="-13"/>
    <edc:Interrupt edc:cname="MemoryManagement" edc:desc="Memory Management, MPU mismatch, including Access Violation and No Match" edc:irq="-12"/>
    <edc:Interrupt edc:cname="BusFault" edc:desc="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault" edc:irq="-11"/>
    <edc:Interrupt edc:cname="UsageFault" edc:desc="Usage Fault, i.e. Undef Instruction, Illegal State Transition" edc:irq="-10"/>
    <edc:Interrupt edc:cname="SVCall" edc:desc="System Service Call via SVC instruction" edc:irq="-5"/>
    <edc:Interrupt edc:cname="DebugMonitor" edc:desc="Debug Monitor" edc:irq="-4"/>
    <edc:Interrupt edc:cname="PendSV" edc:desc="Pendable request for system service" edc:irq="-2"/>
    <edc:Interrupt edc:cname="SysTick" edc:desc="System Tick Timer" edc:irq="-1"/>
    <edc:Interrupt edc:cname="PM" edc:desc="Power Manager" edc:irq="0" ltx:memberofperipheral="PM"/>
    <edc:Interrupt edc:cname="MCLK" edc:desc="Main Clock" edc:irq="1" ltx:memberofperipheral="MCLK"/>
    <edc:Interrupt edc:cname="OSCCTRL_XOSC0" edc:desc="External Oscillator 0" edc:irq="2" ltx:memberofperipheral="OSCCTRL"/>
    <edc:Interrupt edc:cname="OSCCTRL_XOSC1" edc:desc="External Oscillator 1" edc:irq="3" ltx:memberofperipheral="OSCCTRL"/>
    <edc:Interrupt edc:cname="OSCCTRL_DFLL" edc:desc="Digital Frequency Locked Loop" edc:irq="4" ltx:memberofperipheral="OSCCTRL"/>
    <edc:Interrupt edc:cname="OSCCTRL_DPLL0" edc:desc="Digital Phase Locked Loop 0" edc:irq="5" ltx:memberofperipheral="OSCCTRL"/>
    <edc:Interrupt edc:cname="OSCCTRL_DPLL1" edc:desc="Digital Phase Locked Loop 1" edc:irq="6" ltx:memberofperipheral="OSCCTRL"/>
    <edc:Interrupt edc:cname="OSC32KCTRL" edc:desc="32Khz Oscillator Controller" edc:irq="7" ltx:memberofperipheral="OSC32KCTRL"/>
    <edc:Interrupt edc:cname="SUPC_OTHER" edc:desc="Suppyly controller" edc:irq="8" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:cname="SUPC_BODDET" edc:desc="Brown Out Detection" edc:irq="9" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:cname="WDT" edc:desc="Watch Dog Timer" edc:irq="10" ltx:memberofperipheral="WDT"/>
    <edc:Interrupt edc:cname="RTC" edc:desc="Real Time Counter" edc:irq="11" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_0" edc:desc="EIC Channel 0" edc:irq="12" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_1" edc:desc="EIC Channel 1" edc:irq="13" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_2" edc:desc="EIC Channel 2" edc:irq="14" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_3" edc:desc="EIC Channel 3" edc:irq="15" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_4" edc:desc="EIC Channel 4" edc:irq="16" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_5" edc:desc="EIC Channel 5" edc:irq="17" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_6" edc:desc="EIC Channel 6" edc:irq="18" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_7" edc:desc="EIC Channel 7" edc:irq="19" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_8" edc:desc="EIC Channel 8" edc:irq="20" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_9" edc:desc="EIC Channel 9" edc:irq="21" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_10" edc:desc="EIC Channel 10" edc:irq="22" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_11" edc:desc="EIC Channel 11" edc:irq="23" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_12" edc:desc="EIC Channel 12" edc:irq="24" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_13" edc:desc="EIC Channel 13" edc:irq="25" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_14" edc:desc="EIC Channel 14" edc:irq="26" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_15" edc:desc="EIC Channel 15" edc:irq="27" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="FREQM" edc:desc="Frequency Meter" edc:irq="28" ltx:memberofperipheral="FREQM"/>
    <edc:Interrupt edc:cname="NVMCTRL_0" edc:desc="Non-Volatile Memory Controller" edc:irq="29" ltx:memberofperipheral="NVMCTRL"/>
    <edc:Interrupt edc:cname="NVMCTRL_1" edc:desc="NVMCTRL SmartEEPROM Interrupts" edc:irq="30" ltx:memberofperipheral="NVMCTRL"/>
    <edc:Interrupt edc:cname="DMAC_0" edc:desc="DMA Channel 0" edc:irq="31" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:cname="DMAC_1" edc:desc="DMA Channel 1" edc:irq="32" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:cname="DMAC_2" edc:desc="DMA Channel 2" edc:irq="33" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:cname="DMAC_3" edc:desc="DMA Channel 3" edc:irq="34" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:cname="DMAC_OTHER" edc:desc="DMA Channel 4..X" edc:irq="35" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:cname="EVSYS_0" edc:desc="Event System Channel 0" edc:irq="36" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="EVSYS_1" edc:desc="Event System Channel 1" edc:irq="37" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="EVSYS_2" edc:desc="Event System Channel 2" edc:irq="38" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="EVSYS_3" edc:desc="Event System Channel 3" edc:irq="39" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="EVSYS_OTHER" edc:desc="Event System Channel 4..X" edc:irq="40" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="PAC" edc:desc="Peripheral Access Controller" edc:irq="41" ltx:memberofperipheral="PAC"/>
    <edc:Interrupt edc:cname="RAMECC" edc:desc="RAM Error Correction Code" edc:irq="45" ltx:memberofperipheral="RAMECC"/>
    <edc:Interrupt edc:cname="SERCOM0_0" edc:desc="Serial Communication Interface 0" edc:irq="46" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:cname="SERCOM0_1" edc:desc="Serial Communication Interface 0" edc:irq="47" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:cname="SERCOM0_2" edc:desc="Serial Communication Interface 0" edc:irq="48" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:cname="SERCOM0_OTHER" edc:desc="Serial Communication Interface 0" edc:irq="49" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:cname="SERCOM1_0" edc:desc="Serial Communication Interface 1" edc:irq="50" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:cname="SERCOM1_1" edc:desc="Serial Communication Interface 1" edc:irq="51" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:cname="SERCOM1_2" edc:desc="Serial Communication Interface 1" edc:irq="52" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:cname="SERCOM1_OTHER" edc:desc="Serial Communication Interface 1" edc:irq="53" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:cname="SERCOM2_0" edc:desc="Serial Communication Interface 2" edc:irq="54" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:cname="SERCOM2_1" edc:desc="Serial Communication Interface 2" edc:irq="55" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:cname="SERCOM2_2" edc:desc="Serial Communication Interface 2" edc:irq="56" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:cname="SERCOM2_OTHER" edc:desc="Serial Communication Interface 2" edc:irq="57" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:cname="SERCOM3_0" edc:desc="Serial Communication Interface 3" edc:irq="58" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:cname="SERCOM3_1" edc:desc="Serial Communication Interface 3" edc:irq="59" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:cname="SERCOM3_2" edc:desc="Serial Communication Interface 3" edc:irq="60" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:cname="SERCOM3_OTHER" edc:desc="Serial Communication Interface 3" edc:irq="61" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:cname="SERCOM4_0" edc:desc="Serial Communication Interface 4" edc:irq="62" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:cname="SERCOM4_1" edc:desc="Serial Communication Interface 4" edc:irq="63" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:cname="SERCOM4_2" edc:desc="Serial Communication Interface 4" edc:irq="64" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:cname="SERCOM4_OTHER" edc:desc="Serial Communication Interface 4" edc:irq="65" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:cname="SERCOM5_0" edc:desc="Serial Communication Interface 5" edc:irq="66" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:cname="SERCOM5_1" edc:desc="Serial Communication Interface 5" edc:irq="67" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:cname="SERCOM5_2" edc:desc="Serial Communication Interface 5" edc:irq="68" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:cname="SERCOM5_OTHER" edc:desc="Serial Communication Interface 5" edc:irq="69" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:cname="USB_OTHER" edc:desc="Universal Serial Bus" edc:irq="80" ltx:memberofperipheral="USB"/>
    <edc:Interrupt edc:cname="USB_SOF_HSOF" edc:desc="USB Start of Frame" edc:irq="81" ltx:memberofperipheral="USB"/>
    <edc:Interrupt edc:cname="USB_TRCPT0" edc:desc="USB Transfer Complete 0" edc:irq="82" ltx:memberofperipheral="USB"/>
    <edc:Interrupt edc:cname="USB_TRCPT1" edc:desc="USB Transfer Complete 1" edc:irq="83" ltx:memberofperipheral="USB"/>
    <edc:Interrupt edc:cname="TCC0_OTHER" edc:desc="Timer Counter Control 0" edc:irq="85" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:cname="TCC0_MC0" edc:desc="TCC Match/Compare 0" edc:irq="86" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:cname="TCC0_MC1" edc:desc="TCC Match/Compare 1" edc:irq="87" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:cname="TCC0_MC2" edc:desc="TCC Match/Compare 2" edc:irq="88" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:cname="TCC0_MC3" edc:desc="TCC Match/Compare 3" edc:irq="89" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:cname="TCC0_MC4" edc:desc="TCC Match/Compare 4" edc:irq="90" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:cname="TCC0_MC5" edc:desc="TCC Match/Compare 5" edc:irq="91" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:cname="TCC1_OTHER" edc:desc="Timer Counter Control 1" edc:irq="92" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:cname="TCC1_MC0" edc:desc="TCC Match/Compare 0" edc:irq="93" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:cname="TCC1_MC1" edc:desc="TCC Match/Compare 1" edc:irq="94" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:cname="TCC1_MC2" edc:desc="TCC Match/Compare 2" edc:irq="95" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:cname="TCC1_MC3" edc:desc="TCC Match/Compare 3" edc:irq="96" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:cname="TCC2_OTHER" edc:desc="Timer Counter Control 2" edc:irq="97" ltx:memberofperipheral="TCC2"/>
    <edc:Interrupt edc:cname="TCC2_MC0" edc:desc="TCC Match/Compare 0" edc:irq="98" ltx:memberofperipheral="TCC2"/>
    <edc:Interrupt edc:cname="TCC2_MC1" edc:desc="TCC Match/Compare 1" edc:irq="99" ltx:memberofperipheral="TCC2"/>
    <edc:Interrupt edc:cname="TCC2_MC2" edc:desc="TCC Match/Compare 2" edc:irq="100" ltx:memberofperipheral="TCC2"/>
    <edc:Interrupt edc:cname="TC0" edc:desc="Timer Counter 0" edc:irq="107" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:cname="TC1" edc:desc="Timer Counter 1" edc:irq="108" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:cname="TC2" edc:desc="Timer Counter 2" edc:irq="109" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:cname="TC3" edc:desc="Timer Counter 3" edc:irq="110" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:cname="PDEC_OTHER" edc:desc="Position Decoder" edc:irq="115" ltx:memberofperipheral="PDEC"/>
    <edc:Interrupt edc:cname="PDEC_MC0" edc:desc="PDEC Match/Compare 0" edc:irq="116" ltx:memberofperipheral="PDEC"/>
    <edc:Interrupt edc:cname="PDEC_MC1" edc:desc="PDEC Match Compare 1" edc:irq="117" ltx:memberofperipheral="PDEC"/>
    <edc:Interrupt edc:cname="ADC0_OTHER" edc:desc="Analog To Digital Converter 0" edc:irq="118" ltx:memberofperipheral="ADC0"/>
    <edc:Interrupt edc:cname="ADC0_RESRDY" edc:desc="ADC0 Result Ready" edc:irq="119" ltx:memberofperipheral="ADC0"/>
    <edc:Interrupt edc:cname="ADC1_OTHER" edc:desc="Analog To Digital Converter 1" edc:irq="120" ltx:memberofperipheral="ADC1"/>
    <edc:Interrupt edc:cname="ADC1_RESRDY" edc:desc="ADC1 Result Ready" edc:irq="121" ltx:memberofperipheral="ADC1"/>
    <edc:Interrupt edc:cname="AC" edc:desc="Analog Comparator" edc:irq="122" ltx:memberofperipheral="AC"/>
    <edc:Interrupt edc:cname="DAC_OTHER" edc:desc="Digital to Analog Converter" edc:irq="123" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:cname="DAC_EMPTY_0" edc:desc="DAC Buffer 0 Empty" edc:irq="124" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:cname="DAC_EMPTY_1" edc:desc="DAC Buffer 1 Empty" edc:irq="125" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:cname="DAC_RESRDY_0" edc:desc="DAC Filter 0 Result Ready" edc:irq="126" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:cname="DAC_RESRDY_1" edc:desc="DAC Filter 1 Result Ready" edc:irq="127" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:cname="PCC" edc:desc="Parallel Capture Controller" edc:irq="129" ltx:memberofperipheral="PCC"/>
    <edc:Interrupt edc:cname="AES" edc:desc="Advanced Encryption Standard" edc:irq="130" ltx:memberofperipheral="AES"/>
    <edc:Interrupt edc:cname="TRNG" edc:desc="True Random Generator" edc:irq="131" ltx:memberofperipheral="TRNG"/>
    <edc:Interrupt edc:cname="ICM" edc:desc="Integrity Check Monitor" edc:irq="132" ltx:memberofperipheral="ICM"/>
    <edc:Interrupt edc:cname="PUKCC" edc:desc="Public-Key Cryptography Controller" edc:irq="133" ltx:memberofperipheral="PUKCC"/>
    <edc:Interrupt edc:cname="QSPI" edc:desc="Quad SPI interface" edc:irq="134" ltx:memberofperipheral="QSPI"/>
    <edc:Interrupt edc:cname="SDHC0" edc:desc="SD/MMC Host Controller 0" edc:irq="135" ltx:memberofperipheral="SDHC0"/>
  </edc:InterruptList>
  <edc:PeripheralList>
    <edc:Peripheral edc:cname="AC" edc:desc=""/>
    <edc:Peripheral edc:cname="ADC0" edc:desc=""/>
    <edc:Peripheral edc:cname="ADC1" edc:desc=""/>
    <edc:Peripheral edc:cname="AES" edc:desc=""/>
    <edc:Peripheral edc:cname="CCL" edc:desc=""/>
    <edc:Peripheral edc:cname="CMCC" edc:desc=""/>
    <edc:Peripheral edc:cname="DAC" edc:desc=""/>
    <edc:Peripheral edc:cname="DMAC" edc:desc=""/>
    <edc:Peripheral edc:cname="DSU" edc:desc=""/>
    <edc:Peripheral edc:cname="EIC" edc:desc=""/>
    <edc:Peripheral edc:cname="EVSYS" edc:desc=""/>
    <edc:Peripheral edc:cname="FREQM" edc:desc=""/>
    <edc:Peripheral edc:cname="GCLK" edc:desc=""/>
    <edc:Peripheral edc:cname="HMATRIX" edc:desc=""/>
    <edc:Peripheral edc:cname="ICM" edc:desc=""/>
    <edc:Peripheral edc:cname="MCLK" edc:desc=""/>
    <edc:Peripheral edc:cname="NVMCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="FUSES" edc:desc=""/>
    <edc:Peripheral edc:cname="OSCCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="OSC32KCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="PAC" edc:desc=""/>
    <edc:Peripheral edc:cname="PCC" edc:desc=""/>
    <edc:Peripheral edc:cname="PDEC" edc:desc=""/>
    <edc:Peripheral edc:cname="PM" edc:desc=""/>
    <edc:Peripheral edc:cname="PORT" edc:desc=""/>
    <edc:Peripheral edc:cname="PUKCC" edc:desc=""/>
    <edc:Peripheral edc:cname="QSPI" edc:desc=""/>
    <edc:Peripheral edc:cname="RAMECC" edc:desc=""/>
    <edc:Peripheral edc:cname="RSTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RTC" edc:desc=""/>
    <edc:Peripheral edc:cname="SDHC0" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM0" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM1" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM2" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM3" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM4" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM5" edc:desc=""/>
    <edc:Peripheral edc:cname="SUPC" edc:desc=""/>
    <edc:Peripheral edc:cname="TC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TC2" edc:desc=""/>
    <edc:Peripheral edc:cname="TC3" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC2" edc:desc=""/>
    <edc:Peripheral edc:cname="TRNG" edc:desc=""/>
    <edc:Peripheral edc:cname="USB" edc:desc=""/>
    <edc:Peripheral edc:cname="WDT" edc:desc=""/>
    <edc:Peripheral edc:cname="CoreDebug" edc:desc=""/>
    <edc:Peripheral edc:cname="DWT" edc:desc=""/>
    <edc:Peripheral edc:cname="ETM" edc:desc=""/>
    <edc:Peripheral edc:cname="FPU" edc:desc=""/>
    <edc:Peripheral edc:cname="ITM" edc:desc=""/>
    <edc:Peripheral edc:cname="MPU" edc:desc=""/>
    <edc:Peripheral edc:cname="NVIC" edc:desc=""/>
    <edc:Peripheral edc:cname="SysTick" edc:desc=""/>
    <edc:Peripheral edc:cname="SystemControl" edc:desc=""/>
    <edc:Peripheral edc:cname="TPI" edc:desc=""/>
  </edc:PeripheralList>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R0" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R1" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="4" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R2" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="8" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R3" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="12" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R4" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="16" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R5" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="20" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R6" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="24" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R7" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="28" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R8" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="32" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R9" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="36" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R10" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="40" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R11" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="44" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R12" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="48" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SP" edc:desc="Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="52" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MSP" edc:desc="Main Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="64" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PSP" edc:desc="Process Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="68" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LR" edc:desc="Link Register" edc:impl="0xFFFFFFFF" edc:mclr="11111111111111111111111111111111" edc:nmmrid="56" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PC" edc:desc="Program Counter" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="60" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnn--------nnnnnn-nnnnnnnnn" edc:cname="PSR" edc:desc="Program Status Register" edc:impl="0xFF00FDFF" edc:mclr="00000001000000000000000000000000" edc:nmmrid="72" edc:nzwidth="0x20" edc:por="00000001000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnn-------nnnn----------------" edc:cname="APSR" edc:desc="Application Program Status Register" edc:impl="0xF80F0000" edc:mclr="00000000000000000000000000000000" edc:nmmrid="76" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
