adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51G19A.PIC
      <edc:SFRDef edc:_addr="0x41004028" edc:access="------nn" edc:cname="DBGCTRL" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="ECCDIS" edc:desc="Debugger ECC Read Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECCELOG" edc:desc="Debugger ECC Error Tracking Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004029" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x4100402A" edc:access="------nn" edc:cname="SEECFG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="WMODE" edc:desc="Write Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="UNBUFFERED" edc:desc="A NVM write command is issued after each write in the pagebuffer" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="BUFFERED" edc:desc="A NVM write command is issued when a write to a new page is requested" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="APRDIS" edc:desc="Automatic Page Reallocation Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100402B" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x4100402C" edc:access="-------------rrr----rrrr---rrrrr" edc:cname="SEESTAT" edc:impl="0x70F1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="ASEES" edc:desc="Active SmartEEPROM Sector" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOAD" edc:desc="Page Buffer Loaded" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCK" edc:desc="SmartEEPROM Write Access Is Locked" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLOCK" edc:desc="SmartEEPROM Write Access To Register Address Space Is Locked" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SBLK" edc:desc="Blocks Number In a Sector" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PSZ" edc:desc="SmartEEPROM Page Size" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004030" edc:offset="0x1FD0"/>
      <edc:SFRDef edc:_addr="0x41006000" edc:access="------------------rrrrrrrrrr--r-" edc:cname="TYPE" edc:impl="0x3FF2" edc:mclr="00000000000000000001001011010010" edc:nzwidth="0x20" edc:por="00000000000000000001001011010010" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK" edc:desc="dynamic Clock Gating supported" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RRP" edc:desc="Round Robin Policy supported" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAYNUM" edc:desc="Number of Way" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DMAPPED" edc:desc="Direct Mapped Cache" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ARCH2WAY" edc:desc="2-WAY set associative" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="ARCH4WAY" edc:desc="4-WAY set associative" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LCKDOWN" edc:desc="Lock Down supported" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSIZE" edc:desc="Cache Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CSIZE_1KB" edc:desc="Cache Size is 1 KB" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_2KB" edc:desc="Cache Size is 2 KB" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_4KB" edc:desc="Cache Size is 4 KB" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_8KB" edc:desc="Cache Size is 8 KB" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_16KB" edc:desc="Cache Size is 16 KB" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_32KB" edc:desc="Cache Size is 32 KB" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_64KB" edc:desc="Cache Size is 64 KB" edc:when="(field &amp; 0x7) == 6"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLSIZE" edc:desc="Cache Line Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CLSIZE_4B" edc:desc="Cache Line Size is 4 bytes" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CLSIZE_8B" edc:desc="Cache Line Size is 8 bytes" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CLSIZE_16B" edc:desc="Cache Line Size is 16 bytes" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CLSIZE_32B" edc:desc="Cache Line Size is 32 bytes" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="CLSIZE_64B" edc:desc="Cache Line Size is 64 bytes" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="CLSIZE_128B" edc:desc="Cache Line Size is 128 bytes" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006004" edc:access="-------------------------nnn-nn-" edc:cname="CFG" edc:impl="0x76" edc:mclr="00000000000000000000000000100000" edc:nzwidth="0x20" edc:por="00000000000000000000000000100000" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ICDIS" edc:desc="Instruction Cache Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCDIS" edc:desc="Data Cache Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CSIZESW" edc:desc="Cache size configured by software" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CONF_CSIZE_1KB" edc:desc="The Cache Size is configured to 1KB" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CONF_CSIZE_2KB" edc:desc="The Cache Size is configured to 2KB" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CONF_CSIZE_4KB" edc:desc="The Cache Size is configured to 4KB" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CONF_CSIZE_8KB" edc:desc="The Cache Size is configured to 8KB" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="CONF_CSIZE_16KB" edc:desc="The Cache Size is configured to 16KB" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="CONF_CSIZE_32KB" edc:desc="The Cache Size is configured to 32KB" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="CONF_CSIZE_64KB" edc:desc="The Cache Size is configured to 64KB" edc:when="(field &amp; 0x7) == 6"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006008" edc:access="-------------------------------w" edc:cname="CTRL" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="CEN" edc:desc="Cache Controller Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100600C" edc:access="-------------------------------r" edc:cname="SR" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="CSTS" edc:desc="Cache Controller Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006010" edc:access="----------------------------nnnn" edc:cname="LCKWAY" edc:impl="0xF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="LCKWAY" edc:desc="Lockdown way Register" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41006014" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x41006020" edc:access="-------------------------------w" edc:cname="MAINT0" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="INVALL" edc:desc="Cache Controller invalidate All" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006024" edc:access="wwww----------------wwwwwwww----" edc:cname="MAINT1" edc:impl="0xF0000FF0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="INDEX" edc:desc="Invalidate Index" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="WAY" edc:desc="Invalidate Way" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="WAY0" edc:desc="Way 0 is selection for index invalidation" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="WAY1" edc:desc="Way 1 is selection for index invalidation" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="WAY2" edc:desc="Way 2 is selection for index invalidation" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="WAY3" edc:desc="Way 3 is selection for index invalidation" edc:when="(field &amp; 0xF) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006028" edc:access="------------------------------nn" edc:cname="MCFG" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Cache Controller Monitor Counter Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CYCLE_COUNT" edc:desc="Cycle counter" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IHIT_COUNT" edc:desc="Instruction hit counter" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DHIT_COUNT" edc:desc="Data hit counter" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100602C" edc:access="-------------------------------n" edc:cname="MEN" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="MENABLE" edc:desc="Cache Controller Monitor Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006030" edc:access="-------------------------------w" edc:cname="MCTRL" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Cache Controller Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006034" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MSR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="EVENT_CNT" edc:desc="Monitor Event Counter" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
