adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51G19A.PIC
      <edc:SFRDef edc:_addr="0x43002407" edc:access="----rrrr" edc:cname="STATUS" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="READY0" edc:desc="DAC 0 Startup Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="READY1" edc:desc="DAC 1 Startup Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="DAC 0 End of Conversion" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="DAC 1 End of Conversion" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002408" edc:access="--------------------------rrrrrr" edc:cname="SYNCBUSY" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="DAC Enable Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA0" edc:desc="Data DAC 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA1" edc:desc="Data DAC 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATABUF0" edc:desc="Data Buffer DAC 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATABUF1" edc:desc="Data Buffer DAC 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4300240C" edc:access="nnn-nnnnnnn-nnnn" edc:cname="DACCTRL0" edc:impl="0xEFEF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:desc="Left Adjusted Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable DAC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCTRL" edc:desc="Current Control" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CC100K" edc:desc="100kSPS" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CC1M" edc:desc="500kSPS" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CC12M" edc:desc="1MSPS" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FEXT" edc:desc="Standalone Filter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DITHER" edc:desc="Dithering Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFRESH" edc:desc="Refresh period" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="REFRESH_0" edc:desc="Do not Refresh" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_1" edc:desc="Refresh every 30 us" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_2" edc:desc="Refresh every 60 us" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_3" edc:desc="Refresh every 90 us" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_4" edc:desc="Refresh every 120 us" edc:when="(field &amp; 0xF) == 4"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_5" edc:desc="Refresh every 150 us" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_6" edc:desc="Refresh every 180 us" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_7" edc:desc="Refresh every 210 us" edc:when="(field &amp; 0xF) == 7"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_8" edc:desc="Refresh every 240 us" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_9" edc:desc="Refresh every 270 us" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_10" edc:desc="Refresh every 300 us" edc:when="(field &amp; 0xF) == 10"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_11" edc:desc="Refresh every 330 us" edc:when="(field &amp; 0xF) == 11"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_12" edc:desc="Refresh every 360 us" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_13" edc:desc="Refresh every 390 us" edc:when="(field &amp; 0xF) == 13"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_14" edc:desc="Refresh every 420 us" edc:when="(field &amp; 0xF) == 14"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_15" edc:desc="Refresh every 450 us" edc:when="(field &amp; 0xF) == 15"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OSR" edc:desc="Sampling Rate" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OSR_1" edc:desc="No Over Sampling" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OSR_2" edc:desc="2x Over Sampling Ratio" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="OSR_4" edc:desc="4x Over Sampling Ratio" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSR_8" edc:desc="8x Over Sampling Ratio" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="OSR_16" edc:desc="16x Over Sampling Ratio" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="OSR_32" edc:desc="32x Over Sampling Ratio" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4300240E" edc:access="nnn-nnnnnnn-nnnn" edc:cname="DACCTRL1" edc:impl="0xEFEF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:desc="Left Adjusted Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable DAC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCTRL" edc:desc="Current Control" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CC100K" edc:desc="100kSPS" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CC1M" edc:desc="500kSPS" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CC12M" edc:desc="1MSPS" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FEXT" edc:desc="Standalone Filter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DITHER" edc:desc="Dithering Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFRESH" edc:desc="Refresh period" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="REFRESH_0" edc:desc="Do not Refresh" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_1" edc:desc="Refresh every 30 us" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_2" edc:desc="Refresh every 60 us" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_3" edc:desc="Refresh every 90 us" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_4" edc:desc="Refresh every 120 us" edc:when="(field &amp; 0xF) == 4"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_5" edc:desc="Refresh every 150 us" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_6" edc:desc="Refresh every 180 us" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_7" edc:desc="Refresh every 210 us" edc:when="(field &amp; 0xF) == 7"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_8" edc:desc="Refresh every 240 us" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_9" edc:desc="Refresh every 270 us" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_10" edc:desc="Refresh every 300 us" edc:when="(field &amp; 0xF) == 10"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_11" edc:desc="Refresh every 330 us" edc:when="(field &amp; 0xF) == 11"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_12" edc:desc="Refresh every 360 us" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_13" edc:desc="Refresh every 390 us" edc:when="(field &amp; 0xF) == 13"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_14" edc:desc="Refresh every 420 us" edc:when="(field &amp; 0xF) == 14"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_15" edc:desc="Refresh every 450 us" edc:when="(field &amp; 0xF) == 15"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OSR" edc:desc="Sampling Rate" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OSR_1" edc:desc="No Over Sampling" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OSR_2" edc:desc="2x Over Sampling Ratio" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="OSR_4" edc:desc="4x Over Sampling Ratio" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSR_8" edc:desc="8x Over Sampling Ratio" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="OSR_16" edc:desc="16x Over Sampling Ratio" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="OSR_32" edc:desc="32x Over Sampling Ratio" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002410" edc:access="wwwwwwwwwwwwwwww" edc:cname="DATA0" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="DAC0 Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002412" edc:access="wwwwwwwwwwwwwwww" edc:cname="DATA1" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="DAC0 Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002414" edc:access="wwwwwwwwwwwwwwww" edc:cname="DATABUF0" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATABUF" edc:desc="DAC0 Data Buffer" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002416" edc:access="wwwwwwwwwwwwwwww" edc:cname="DATABUF1" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATABUF" edc:desc="DAC0 Data Buffer" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002418" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x43002419" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x4300241C" edc:access="rrrrrrrrrrrrrrrr" edc:cname="RESULT0" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="RESULT" edc:desc="Filter Result" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
